number_of_month = int(input("Введите порядковый номер месяца: "))
lst_seasons = ['Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето',
               'Лето', 'Осень', 'Осень', 'Осень', 'Зима']
dict_seasons = {1: 'Зима', 2: 'Зима', 3: 'Весна', 4: 'Весна', 5: 'Весна',
                6: 'Лето', 7: 'Лето', 8: 'Лето', 9: 'Осень', 10: 'Осень',
                11: 'Осень', 12: 'Зима'}
print(f"Результат через список: {lst_seasons[number_of_month - 1]}.\n"
      f"Результат через словарь: {dict_seasons.get(number_of_month)}.")
